In [1]:
from google.colab import drive
drive.mount("/content/drive")

Mounted at /content/drive

# **Reading Data Set**

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
df = pd.read_csv("/content/drive/MyDrive/Salaries.csv")

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
df.head()

   Id       EmployeeName  ...         Agency Status
0   1     NATHANIEL FORD  ...  San Francisco    NaN
1   2       GARY JIMENEZ  ...  San Francisco    NaN
2   3     ALBERT PARDINI  ...  San Francisco    NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco    NaN
4   5    PATRICK GARDNER  ...  San Francisco    NaN

[5 rows x 13 columns]

# **Find Numbers of Rows and Coloumns**

In [4]:
print("number of Rows :",df.shape[0])
print("number of Coloumns :",df.shape[1])

number of Rows : 148654
number of Coloumns : 13

# **Get information about Dataset**

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      148652 non-null  object
 1   JobTitle          148654 non-null  object
 2   BasePay           148045 non-null  float64
 3   OvertimePay       148654 non-null  object
 4   OtherPay          148654 non-null  object
 5   Benefits          112495 non-null  object
 6   TotalPay          148654 non-null  float64
 7   TotalPayBenefits  148654 non-null  float64
 8   Year              148654 non-null  int64
 9   Status            38119 non-null   object
dtypes: float64(3), int64(1), object(6)
memory usage: 11.3+ MB

# **Remove Notes , Agency Coloumns**

In [6]:
df = df.drop(["Notes","Agency","Id"],axis=1)

# **Find Occurances of Employees(Top 5)**

In [7]:
df["EmployeeName"].value_counts()[:5]

Kevin Lee       13
Steven Lee      11
William Wong    11
Richard Lee     11
Stanley Lee      9
Name: EmployeeName, dtype: int64

In [8]:
df['Benefits'].value_counts()

0.0         1053
0.00         681
7959.18      348
4659.36      107
25699.2       83
            ...
39352.99       1
112.72         1
34164.52       1
8729.29        1
56744.62       1
Name: Benefits, Length: 99635, dtype: int64

# **Total jobs Contain Captain**

In [9]:
len(df[df['JobTitle'].str.contains("Captain",case=False)])

552

# **Average of Totalbay and Totalbay+benefits**

In [10]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Status'],
      dtype='object')

In [11]:
df["TotalPay"].mean()
df["TotalPayBenefits"].mean()

93692.55481056834

# **Replace not provided in EmployeeName with nan**

In [12]:
df["EmployeeName"]=df["EmployeeName"].replace("Not Provided",np.nan)

# **Display name of employee with highest basebay**

In [27]:
df["BasePay"]=df["BasePay"].replace("Not Provided",np.nan)
df["BasePay"]=df["BasePay"].apply(pd.to_numeric)

In [31]:
df[df["BasePay"]==df["BasePay"].max()]["EmployeeName"]

72925    Gregory P Suhr
Name: EmployeeName, dtype: object

# **Find average base pay , TotalPay per job title**

In [50]:
df.groupby("JobTitle").mean()[["BasePay","TotalPay"]].sort_values(by="BasePay",ascending=False)

                                              BasePay       TotalPay
JobTitle
Chief of Police                         309767.683333  329183.646667
Chief, Fire Department                  304232.340000  325971.683333
Gen Mgr, Public Trnsp Dept              297769.413333  297769.413333
CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)  285262.000000  302377.730000
Dep Dir for Investments, Ret            276153.765000  278592.545000
...                                               ...            ...
Captain, (Fire Department)                        NaN   35332.780000
Drug Court Coordinator                            NaN       0.000000
IS Technician Assistant                           NaN       0.000000
Not provided                                      NaN       0.000000
Public Safety Comm Tech                           NaN       0.000000

[2159 rows x 2 columns]